---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarInSystem
source: html/a0cec0be-5011-e36f-0da2-9cf8d380d87e.htm
---
# RebarInSystem Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.